Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/edc/PIC32MM0032GPL028.PIC
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="UserTraceData2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="UserTraceData2" edc:nmmrflags="0a" edc:nmmrid="352" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Data" edc:desc="" edc:mask="0xffffffff" edc:name="Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="n-------nnnnnnnnn-------nnnnnnnn" edc:cname="TraceBPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-------000000000-------00000000" edc:name="TraceBPC" edc:nmmrflags="0d" edc:nmmrid="732" edc:nzwidth="0x20" edc:por="0-------000000000-------00000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IBPOn" edc:desc="" edc:mask="0xff" edc:name="IBPOn" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="IE" edc:desc="" edc:mask="0x1" edc:name="IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DBPOn" edc:desc="" edc:mask="0xff" edc:name="DBPOn" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="DE" edc:desc="" edc:mask="0x1" edc:name="DE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="----------------------------rrrr" edc:cname="Debug2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------xxxx" edc:name="Debug2" edc:nmmrflags="0e" edc:nmmrid="860" edc:nzwidth="0x20" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PACO" edc:desc="" edc:mask="0x1" edc:name="PACO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TUP" edc:desc="" edc:mask="0x1" edc:name="TUP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DQ" edc:desc="" edc:mask="0x1" edc:name="DQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRM" edc:desc="" edc:mask="0x1" edc:name="PRM" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DEPC" edc:nmmrflags="0t" edc:nmmrid="224" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DEPC" edc:desc="" edc:mask="0xffffffff" edc:name="DEPC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="r-------------------nnnnnnnnr-nn" edc:cname="PerfCtl0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1-------------------xxxxxxx0x-xx" edc:name="PerfCtl0" edc:nmmrflags="0t" edc:nmmrid="228" edc:nzwidth="0x20" edc:por="1-------------------xxxxxxx0x-xx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EXL" edc:desc="" edc:mask="0x1" edc:name="EXL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="K" edc:desc="" edc:mask="0x1" edc:name="K" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="U" edc:desc="" edc:mask="0x1" edc:name="U" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE" edc:desc="" edc:mask="0x1" edc:name="IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVENT" edc:desc="" edc:mask="0x7f" edc:name="EVENT" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x13"/>
            <edc:SFRFieldDef edc:cname="M" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PerfCnt0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PerfCnt0" edc:nmmrflags="0a" edc:nmmrid="356" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Counter" edc:desc="" edc:mask="0xffffffff" edc:name="Counter" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="r-------------------nnnnnnnnr-nn" edc:cname="PerfCtl1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1-------------------xxxxxxx0x-xx" edc:name="PerfCtl1" edc:nmmrflags="0b" edc:nmmrid="484" edc:nzwidth="0x20" edc:por="1-------------------xxxxxxx0x-xx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EXL" edc:desc="" edc:mask="0x1" edc:name="EXL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="K" edc:desc="" edc:mask="0x1" edc:name="K" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="U" edc:desc="" edc:mask="0x1" edc:name="U" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IE" edc:desc="" edc:mask="0x1" edc:name="IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVENT" edc:desc="" edc:mask="0x7f" edc:name="EVENT" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x13"/>
            <edc:SFRFieldDef edc:cname="M" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PerfCnt1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PerfCnt1" edc:nmmrflags="0c" edc:nmmrid="612" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Counter" edc:desc="" edc:mask="0xffffffff" edc:name="Counter" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="n-------------------------------" edc:cname="ErrCtl" edc:desc="" edc:impl="0xdfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-------------------------------" edc:name="ErrCtl" edc:nmmrflags="0t" edc:nmmrid="232" edc:nzwidth="0x20" edc:por="0-------------------------------">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1f"/>
            <edc:SFRFieldDef edc:cname="PE" edc:mask="0x1" edc:name="PE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="rrnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CacheErr" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="CacheErr" edc:nmmrflags="0t" edc:nmmrid="236" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Addr" edc:mask="0x3fffffff" edc:name="Addr" edc:nzwidth="0x1e"/>
            <edc:SFRFieldDef edc:cname="EB" edc:desc="" edc:mask="0x1" edc:name="EB" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ER" edc:desc="" edc:mask="0x1" edc:name="ER" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
