Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/edc/PIC32MM0032GPL028.PIC
      <edc:SFRDef edc:_addr="0x1F8023E0" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-02695_pfm_ctrl_32bit_upb_v1.Module" edc:_refcount="1" edc:access="c-------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMPWP" edc:desc="" edc:impl="0x80ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1-------000000000000000000000000" edc:name="NVMPWP" edc:nzwidth="32" edc:por="1-------000000000000000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PWP" edc:desc="" edc:mask="0xffffff" edc:name="PWP" edc:nzwidth="24"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="PWPULOCK" edc:desc="" edc:mask="0x1" edc:name="PWPULOCK" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8023F0" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-02695_pfm_ctrl_32bit_upb_v1.Module" edc:_refcount="1" edc:access="----------------c----nnn--------" edc:cname="NVMBWP" edc:desc="" edc:impl="0x8700" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1----111--------" edc:name="NVMBWP" edc:nzwidth="32" edc:por="----------------1----111--------" edc:portals="CLR SET INV" ltx:baseofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="BWP0" edc:desc="" edc:mask="0x1" edc:name="BWP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BWP1" edc:desc="" edc:mask="0x1" edc:name="BWP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BWP2" edc:desc="" edc:mask="0x1" edc:name="BWP2" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="BWPULOCK" edc:desc="" edc:mask="0x1" edc:name="BWPULOCK" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F802400" edc:offset="0x80"/>
      <edc:SFRDef edc:_addr="0x1F802480" edc:_begin="0x1d0" edc:_end="0x1e0" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="2" edc:access="--------------------n-----------" edc:cname="RPCON" edc:desc="" edc:impl="0x800" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------0-----------" edc:name="RPCON" edc:nzwidth="32" edc:por="--------------------0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="10"/>
            <edc:SFRFieldDef edc:cname="IOLOCK" edc:desc="" edc:mask="0x1" edc:name="IOLOCK" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F802490" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x1F8024A0" edc:_begin="0x1e0" edc:_end="0x210" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="3" edc:access="---------------------------nnnnn" edc:cname="RPINR1" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPINR1" edc:nzwidth="32" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT4R" edc:desc="" edc:mask="0x1f" edc:name="INT4R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8024B0" edc:_begin="0x1e0" edc:_end="0x210" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn----------------" edc:cname="RPINR2" edc:desc="" edc:impl="0x1f1f0000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000----------------" edc:name="RPINR2" edc:nzwidth="32" edc:por="---00000---00000----------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="ICM1R" edc:desc="" edc:mask="0x1f" edc:name="ICM1R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ICM2R" edc:desc="" edc:mask="0x1f" edc:name="ICM2R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8024C0" edc:_begin="0x1e0" edc:_end="0x210" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="3" edc:access="---------------------------nnnnn" edc:cname="RPINR3" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPINR3" edc:nzwidth="32" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ICM3R" edc:desc="" edc:mask="0x1f" edc:name="ICM3R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8024D0" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x1F8024E0" edc:_begin="0x210" edc:_end="0x230" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="4" edc:access="---nnnnn---nnnnn----------------" edc:cname="RPINR5" edc:desc="" edc:impl="0x1f1f0000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000----------------" edc:name="RPINR5" edc:nzwidth="32" edc:por="---00000---00000----------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="OCFAR" edc:desc="" edc:mask="0x1f" edc:name="OCFAR" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OCFBR" edc:desc="" edc:mask="0x1f" edc:name="OCFBR" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8024F0" edc:_begin="0x210" edc:_end="0x230" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="4" edc:access="-------------------nnnnn---nnnnn" edc:cname="RPINR6" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------00000---00000" edc:name="RPINR6" edc:nzwidth="32" edc:por="-------------------00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TCKIAR" edc:desc="" edc:mask="0x1f" edc:name="TCKIAR" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="TCKIBR" edc:desc="" edc:mask="0x1f" edc:name="TCKIBR" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
