Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/edc/PIC32MM0032GPL028.PIC
      <edc:SFRDef edc:_addr="0x1F8026C0" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="---------------------------nnnnn" edc:cname="SR0A" edc:desc="" edc:grp="PORTA" edc:impl="0xffc0001f" edc:ishidden="true" edc:isidehidden="true" edc:isindirect="false" edc:islanghidden="true" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="SR0A" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR0A0" edc:desc="" edc:mask="0x1" edc:name="SR0A0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0A1" edc:desc="" edc:mask="0x1" edc:name="SR0A1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0A2" edc:desc="" edc:mask="0x1" edc:name="SR0A2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0A3" edc:desc="" edc:mask="0x1" edc:name="SR0A3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0A4" edc:desc="" edc:mask="0x1" edc:name="SR0A4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8026D0" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="---------------------------nnnnn" edc:cname="SR1A" edc:desc="" edc:grp="PORTA" edc:impl="0xffc0001f" edc:ishidden="true" edc:isidehidden="true" edc:isindirect="false" edc:islanghidden="true" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="SR1A" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR1A0" edc:desc="" edc:mask="0x1" edc:name="SR1A0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1A1" edc:desc="" edc:mask="0x1" edc:name="SR1A1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1A2" edc:desc="" edc:mask="0x1" edc:name="SR1A2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1A3" edc:desc="" edc:mask="0x1" edc:name="SR1A3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1A4" edc:desc="" edc:mask="0x1" edc:name="SR1A4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8026E0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F802700" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="9" edc:access="----------------nnnn--------nnnn" edc:cname="ANSELB" edc:desc="" edc:grp="PORTB" edc:impl="0xfffff00f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111--------1111" edc:name="ANSELB" edc:nzwidth="0x20" edc:por="----------------1111--------1111" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANSB0" edc:desc="" edc:mask="0x1" edc:name="ANSB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB1" edc:desc="" edc:mask="0x1" edc:name="ANSB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB2" edc:desc="" edc:mask="0x1" edc:name="ANSB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB3" edc:desc="" edc:mask="0x1" edc:name="ANSB3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSB12" edc:desc="" edc:mask="0x1" edc:name="ANSB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB13" edc:desc="" edc:mask="0x1" edc:name="ANSB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB14" edc:desc="" edc:mask="0x1" edc:name="ANSB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB15" edc:desc="" edc:mask="0x1" edc:name="ANSB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
